abadr99/stm32f10xxx_cpp_interface/dev/mcal/src/Systick.cpp
/**
 * @file Systick.cpp
 * @author ManarAbdelraouf
 * @version 0.1
 * @date 2024-04-12
 * 
 * @copyright Copyright (c) 2024
 * 
 */
#include "mcal/inc/stm32f103xx.h"
#include "utils/inc/Types.h"
#include "utils/inc/BitManipulation.h"
#include "mcal/inc/Systick.h"
#include "utils/inc/Assert.h"

using namespace stm32::utils::bit_manipulation;
using namespace stm32::dev::mcal::systick;
using namespace stm32::registers::systick;

// ------- ASSERTS TO ENSURE SYSTICK LAYOUT
ASSERT_STRUCT_SIZE(SystickRegDef, (sizeof(RegWidth_t) * 3));
ASSERT_MEMBER_OFFSET(SystickRegDef, CTRL, 0);
ASSERT_MEMBER_OFFSET(SystickRegDef, LOAD, sizeof(RegWidth_t) * 1);
ASSERT_MEMBER_OFFSET(SystickRegDef, VAL,  sizeof(RegWidth_t) * 2);

// ------- DEFINE SOME USEFUL CONSTANTS
static constexpr uint32_t kSystickMaxVal = GetOnes<uint32_t>(24);

typename Systick::pFunction Systick::PointerToISR = nullptr;

void Systick::Enable(CLKSource clksource) {
    SYSTICK->CTRL.ENABLE = 1;
    SYSTICK->CTRL.TICKINT = 0;
    SYSTICK->CTRL.CLKSOURCE = clksource;
    SetPointerToISR(nullptr);
}

void  Systick::SetCounterValue(uint32_t value) {
    STM32_ASSERT(value <= kSystickMaxVal);
    SYSTICK->CTRL.ENABLE = 1;
    SYSTICK->LOAD = value;
    while (SYSTICK->CTRL.COUNTFLAG == 0) {}
    SYSTICK->CTRL.COUNTFLAG = 0;
    SYSTICK->CTRL.ENABLE = 0;
}

void Systick::Delay_ms(uint32_t time_ms) {
    auto GetDivisor = []() {
        return SYSTICK->CTRL.CLKSOURCE == 1 ? 1000   // STK_CLK_AHB
                                            : 8000;  // STK_CLK_AHB_DIV_8
    };

    uint32_t loadValue = time_ms * (F_CPU / GetDivisor());
    SetCounterValue(loadValue);
}

void Systick::Delay_us(uint32_t time_us) {
    auto GetDivisor = []() {
        return SYSTICK->CTRL.CLKSOURCE == 1 ? 1000000   // STK_CLK_AHB
                                            : 8000000;  // STK_CLK_AHB_DIV_8
    };
    uint32_t loadValue = (time_us * (F_CPU / GetDivisor()));
    // DISABLE SYSTICK
    SYSTICK->CTRL.ENABLE = 0;
    SetCounterValue(loadValue);
}

void Systick::Delay_By_Exception(uint32_t value, pFunction func) {
    STM32_ASSERT(func != NULL && value <= kSystickMaxVal);
    SYSTICK->LOAD = value;
    SetPointerToISR(func);
    SYSTICK->CTRL.TICKINT = 1;
}

uint32_t Systick::GetElapsedTime() {
    return SYSTICK->LOAD - SYSTICK->VAL;
}

void Systick::Disable() {
    SYSTICK->CTRL.ENABLE = 0;
    SYSTICK->CTRL.CLKSOURCE = kAHB;
    SetPointerToISR(nullptr);
}

void Systick::SetPointerToISR(pFunction func) {
    Systick::PointerToISR = func;
}
typename Systick::pFunction Systick::GetPointerToISR() {
    return Systick::PointerToISR;
}

extern "C" void SysTick_Handler(void) {
    typename Systick::pFunction fun = Systick::GetPointerToISR();
    if (fun != NULL) {
        fun();
        SYSTICK->CTRL.ENABLE = 0;
        SYSTICK->VAL = 1;
    }
}

